Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/creating_dataset_with_images.po
Languages: de, fr

source: Creating a dataset with images
de: Erstellen eines Datensatzes mit Bildern
fr: Création d'un jeu de données avec des images

source: It is possible to source images, as well as other media types of files, into the platform.
de: Es ist möglich, Bilder sowie andere Mediendateien auf die Plattform zu laden.
fr: Il est possible d'ajouter des images, ainsi que d'autres types de fichiers média à la plateforme.

source: All formats considered as images by the platform (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg) will be imported as such. It means that a thumbnail will be generated for these formats, activating the Images visualization. Other types of files (such as PDF) can also be added into a dataset, however no thumbnail will be generated and the Images visualization will not be available. Users will only be able to download these files.
de: Alle Formate, die von der Plattform als Bilder erkannt werden (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg), werden derart hochgeladen. Es wird eine Miniaturansicht für diese Formate erzeugt, wodurch die Visualisierung der Bilder aktiviert wird. Andere Dateitypen (wie PDF) können ebenfalls zu einem Datensatz hinzugefügt werden, doch wird in diesem Fall keine Miniaturansicht erzeugt und eine Visualisierung ist nicht möglich. Benutzer können solche Dateien nur herunterladen.
fr: Tous les formats considérés comme étant des images par la plateforme (.gif, .png, .jpeg, .jpg, .tiff, .bmp, .svg) seront importés tels quels. Cela signifie qu'une vignette sera générée pour ces formats, ce qui activera la visualisation Images. D'autres types de fichiers (comme les PDF) peuvent également être ajoutés à un jeu de données, mais aucune vignette ne sera générée et la visualisation Images sera indisponible. Les utilisateurs pourront uniquement télécharger ces fichiers.

source: There are 2 different methods to source images and add them into a dataset: with an archive file or via a URL.
de: Es gibt 2 Möglichkeiten, um Bilder hochzuladen und zu einem Datensatz hinzuzufügen: mit einem Archiv oder über eine URL.
fr: Deux méthodes sont proposées pour collecter des images et les ajouter à un jeu de données : avec un fichier d'archive ou via une URL.

source: Sourcing images with an archive file
de: Bilder mithilfe eines Archivs hinzufügen
fr: Collecte d'images avec un fichier d'archive

source: This method consists in building an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the images, and then to import it into the platform.
de: Bei dieser Methode erzeugen Sie eine Archivdatei (siehe :ref:`Unterstützte komprimierte Dateiformate<supportedcompressedformats>`) mit Dateien, die anschließend in die Plattform importiert werden.
fr: Cette méthode consiste à créer un fichier d'archive (voir :ref:`Formats de fichiers compressés pris en charge<supportedcompressedformats>`) avec les images, puis à l'importer dans la plateforme.

source: Building the archive file
de: Aufbau der Archivdatei
fr: Création d'un fichier d'archive

source: The archive file should contain:
de: Die Archivdatei solle Folgendes enthalten:
fr: Le fichier d'archive doit contenir :

source: the files (images)
de: die Dateien (Bilder)
fr: les fichiers (images) ;

source: a CSV file listing the files (images) and their metadata
de: eine CSV-Datei, die die Dateien (Bilder) und Metadaten auflistet
fr: un fichier CSV répertoriant les fichiers (images) et les métadonnées associées.

source: CSV file
de: CSV-Datei
fr: Fichier CSV

source: There must be only one CSV file, and it must only be in a CSV format.
de: Es darf nur eine CSV-Datei vorhanden sein und sie muss das CSV-Format aufweisen.
fr: Un seul fichier au format CSV doit être inclus.

source: The CSV file must contain a column with the files (images) names ; all other columns will be considered as additional fields.
de: Die CSV-Datei muss eine Spalte mit Dateinamen (Bildnamen) enthalten; weitere Spalten werden als zusätzliche Felder betrachtet.
fr: Le fichier CSV doit avoir une colonne contenant les noms des fichiers (images) ; toutes les autres colonnes sont considérées comme des champs supplémentaires.

source: Example:
de: Beispiel:
fr: Exemple :

source: Scale
de: Maßstab
fr: Échelle

source: Title
de: Titel
fr: Titre

source: File
de: Datei
fr: Fichier

source: Image 1
de: Bild 1

source: Image 2
de: Bild 2

source: Subdirectories in archive file
de: Unterverzeichnisse in der Archivdatei
fr: Sous-répertoires dans un fichier d'archive

source: We recommend to keep all images at the same level into the archive file. However, if images are into subdirectories, keep in mind to write the whole path in the CSV file.
de: Wir empfehlen, dass sich alle Bilder im gleichen Bereich der Archivdatei befinden. Sollten sich dennoch Dateien in Unterverzeichnissen befinden, müssen Sie den vollständigen Pfad in der CSV-Datei schreiben.
fr: Nous vous recommandons de laisser toutes les images au même niveau dans le fichier d'archive. Toutefois, si les images se trouvent dans des sous-répertoires, gardez à l'esprit que vous devez saisir l'ensemble du chemin dans le fichier CSV.

source: Sourcing the archive file
de: Die Archivdatei hinzufügen
fr: Collecte du fichier d'archive

source: Once the archive file is created, it can be imported into the platform.
de: Sobald die Archivdatei erstellt wurde, kann sie auf die Plattform hochgeladen werden.
fr: Une fois le fichier d'archive créé, il peut être importé dans la plateforme.

source: In Catalog > Datasets, click on the **New dataset** button.
de: Klicken Sie unter Katalog > Datensätze auf die Schaltfläche **Neuer Datensatz**.
fr: Dans Catalogue > Jeux de données, cliquez sur le bouton **Nouveau jeu de données**.

source: Click on the **Add a source** button.
de: Klicken Sie auf den Button **Eine Quelle hinzufügen**.
fr: Cliquez sur le bouton **Ajouter une source**.

source: Click on the **Upload a file** button.
de: Klicken Sie auf den Button **Eine Datei hochladen**.
fr: Cliquez sur le bouton **Ajouter un fichier**.

source: Choose the archive file you created, with your images inside.
de: Wählen Sie die von Ihnen erstellte Archivdatei, die Ihre Bilder enthält.
fr: Sélectionnez le fichier d'archive que vous avez créé, contenant vos images.

source: Click on the **Open** button of the file selection window.
de: Klicken Sie im Dateiauswahlfenster auf den Button **Öffnen**.
fr: Dans la fenêtre de sélection de fichiers, cliquez sur le bouton **Ouvrir**.

source: It is possible to simply drag and drop the file after steps 1 and 2, instead of following the whole file selection procedure.
de: Nach den Schritten 1 und 2 können Sie die Datei einfach per Drag & Drop hinzufügen, statt das gesamte Auswahlverfahren erneut zu durchlaufen.
fr: Après les étapes 1 et 2, vous pouvez simplement glisser et déposer le fichier, plutôt que de suivre l'intégralité de la procédure de sélection de fichiers.

source: Sourcing images via a URL
de: Bilder über eine URL hinzufügen
fr: Collecte d'images via une URL

source: This method consists in sourcing images stored in a remote server, and using a processor to define the images and extract their metadata.
de: Bei dieser Methode werden Bilder eingespeist, die auf einem Remote-Server gespeichert sind. Unter Einsatz eines Prozessors werden die Bilder festgelegt und ihre Metadaten extrahiert.
fr: Cette méthode consiste à collecter des images stockées sur un serveur distant et à utiliser un processeur pour définir les images et extraire les métadonnées associées.

source: For this method, OpenDataSoft supports the following protocols: http, and its secured version https. Both link to a single file (e.g. http://example.org/mydata.csv).
de: OpenDataSoft unterstützt die folgenden Protokolle für diese Vorgehensweise: http und die abgesicherte Version https, beide mit einem Link zu einer Einzeldatei (z. B. http://example.org/mydata.csv).
fr: Pour cette méthode, OpenDataSoft prend en charge les protocoles suivants : http et sa version sécurisée https. Ils permettent d'accéder à un fichier simple (par ex. http://example.org/mydata.csv).

source: In the **Enter a URL** box, write the URL of the remote server where the images are stored.
de: Geben Sie in das Feld **Eine URL eingeben** die URL des Remote-Servers ein, auf dem die Bilder gespeichert sind.
fr: Dans le champ **Saisir une URL**, saisissez l'URL du serveur distant sur lequel les images sont stockées.

source: Once the connection with the platform is made and the images sourced, click on the **Processing** tab.
de: Sobald die Verbindung zur Plattform hergestellt und die Bilder eingeholt wurden, klicken Sie auf den Tab **Verarbeiten**.
fr: Une fois la connexion avec la plateforme établie et les images collectées, cliquez sur l'onglet **Traitement**.

source: Click on the **Add a processor** button.
de: Klicken Sie auf den Button **Einen Prozessor hinzufügen**.
fr: Cliquez sur le bouton **Ajouter un processeur**.

source: Choose the File processor, in the Generic operations section.
de: Wählen Sie den Dateiprozessor im Bereich "Generische Operationen".
fr: Choisissez le processeur de fichiers dans la section Opérations génériques.

source: In the File processor area, indicate which field contains the images.
de: Wählen Sie im Bereich des Dateiprozessors das Feld, das die Bilder enthält.
fr: Dans la section du processeur de fichiers, indiquez quel champ contient les images.

source: *(optional)* Still in the File processor area, tick the **Extract metadata** box to import the related metadata of the images.
de: *(optional)* Im Bereich des Dateiprozessors können Sie das Feld **Metadaten extrahieren** ankreuzen, um die zu den Bildern gehörenden Metadaten zu importieren.
fr: *(optionnel)* Toujours dans la section du processeur de fichiers, cochez la case **Extraire des métadonnées** pour importer les métadonnées des images.

source: Displaying images
de: Bilder anzeigen
fr: Affichage des images

source: Once the images are imported into the platform, they can be displayed in 2 different ways:
de: Nachdem die Bilder in die Plattform importiert wurden, können sie auf zwei verschiedene Arten angezeigt werden:
fr: Une fois les images importées dans la plateforme, elles peuvent être affichées de deux façons différentes :

source: through the default Images visualization tab: an image gallery displaying all the images and their metadata
de: über den Tab zur standardmäßigen Bildvisualisierung: eine Bildergalerie, in der alle Bilder und Metadaten zu sehen sind
fr: via l'onglet de visualisation Images par défaut : une galerie d'images présentant toutes les images et les métadonnées associées ;

source: through a slideshow, which is `an OpenDataSoft widget <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ that can be added in any code area of the platform (e.g. in the Custom view of the dataset or in a content page): in that case, images are displayed one by one
de: mit einer Diashow. Dies ist ein `OpenDataSoft-Widget <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ das in jedem Codebereich der Plattform hinzugefügt werden kann (z. B. in der benutzerdefinierten Ansicht des Datensatzes oder in einer Inhaltsseite): In diesem Fall werden die Bilder einzeln angezeigt
fr: via un diaporama, `un widget OpenDataSoft <http://opendatasoft.github.io/ods-widgets/docs/#/api/ods-widgets.directive:odsSlideshow>`_ qui peut être ajouté dans n'importe quelle section de code de la plateforme (par ex. dans la vue personnalisée du jeu de données ou dans une page de contenu) : dans ce cas, les images sont affichées une par une.

source: Exporting and downloading images
de: Bilder exportieren und herunterladen
fr: Export et téléchargement d'images

source: Images imported into the platform can only be downloaded or exported one by one. There is no way to download all the images of a dataset at the same time.
de: Bilder, die in die Plattform importiert wurden, können nur einzeln heruntergeladen oder exportiert werden. Es gibt keine Möglichkeit, alle Bilder eines Datensatzes gleichzeitig herunterzuladen.
fr: Les images importées dans la plateforme peuvent uniquement être téléchargées ou exportées une par une. Aucune option permettant de télécharger simultanément toutes les images d'un jeu de données n'est disponible.

source: Downloading an image
de: Ein Bild herunterladen
fr: Téléchargement d'une image

source: In the front office, go to the **Images** visualization tab of the dataset containing the image(s) to download.
de: Öffnen Sie im Front Office den Tab zur Visualisierung der **Bilder** des Datensatzes, der das/die herunterzuladenden Bild(er) enthält.
fr: Dans la plateforme, accédez à l'onglet de visualisation **Images** du jeu de données contenant les images à télécharger.

source: Click on the image to download.
de: Klicken Sie auf das Bild, das Sie herunterladen möchten.
fr: Cliquez sur l'image à télécharger.

source: At the end on the image's metadata, click on the **Download image** button.
de: Klicken Sie am Ende der Metadaten des Bildes auf den Button **Bild herunterladen**.
fr: À la fin des métadonnées de l'image, cliquez sur le bouton **Télécharger l'image**.

source: Exporting dataset to retrieve image URL
de: Datensatz exportieren, um die Bild-URL abzurufen
fr: Export d'un jeu de données pour récupérer l'URL d'image

source: In the front office, go the **Export** tab of the dataset containing the image(s) to export.
de: Öffnen Sie im Front Office den Tab **Export** des Datensatzes, der das/die zu exportierende(n) Bild(er) enthält.
fr: Dans la plateforme, accédez à l'onglet **Exporter** du jeu de données contenant les images à exporter.

source: Export the whole dataset, or part of it if it's filtered.
de: Exportieren Sie den gesamten Datensatz oder einen Teil davon (wenn er gefiltert ist).
fr: Exportez l'intégralité du jeu de données ou juste une partie de celui-ci s'il est filtré.

source: Open the exported dataset in the spreadsheet software of your choice.
de: Öffnen Sie den exportierten Datensatz in der gewünschten Tabellenkalkulationssoftware.
fr: Ouvrez le jeu de données exporté dans le tableur de votre choix.

source: Find the field containing the URLs of the image and retrieve them.
de: Suchen Sie das Feld, das die URLs des Bildes enthält und erfassen Sie sie.
fr: Recherchez le champ contenant les URL de l'image et récupérez-les.
