Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/creating_dataset_with_multiple_files.po
Languages: de, fr

source: Creating a dataset with multiple files
de: Erstellen eines Datensatzes mit mehreren Dateien
fr: Création d'un jeu de données avec plusieurs fichiers

source: It is possible to add multiple files to a dataset, as well as to have multiple sources into one dataset.
de: Es können mehrere Dateien zu einem Datensatz hinzugefügt werden. Außerdem können mehrere Quellen in einen Datensatz eingespeist werden.
fr: Il est possible d'ajouter plusieurs fichiers dans un jeu de données, ainsi que d'avoir plusieurs sources dans un même jeu de données.

source: There are 3 methods to add multiple files into a dataset: by adding them one by one, or by adding multiple files at the same time either through an archive file or via an FTP server.
de: Es gibt 3 Möglichkeiten, um einem Datensatz mehrere Dateien hinzuzufügen: entweder sie werden einzeln hinzugefügt oder mehrere gleichzeitig über eine Archivdatei oder einen FTP-Server.
fr: Trois méthodes permettent d'ajouter plusieurs fichiers à un jeu de données : en les ajoutant un par un ou en ajoutant plusieurs fichiers simultanément via un fichier d'archive ou un serveur FTP.

source: Sourcing files one by one
de: Dateien einzeln einspeisen
fr: Collecte de fichiers un par un

source: This method consists in adding several files one by one into the platform, creating as many sources as the number of added files. In that case, because a new source is created for each added file, those can have different formats (see :doc:`Supported formats</sourcing_and_processing_data/supported_formats>`)
de: Bei dieser Methode werden mehrere Dateien einzeln zur Plattform hinzugefügt. Dabei entspricht die Anzahl der erzeugten Quellen derjenigen der hinzugefügten Dateien. In diesem Fall - und weil für jede hinzugefügte Datei eine neue Quelle erstellt wird - können sie unterschiedliche Formate aufweisen ( siehe :doc:`Unterstützte Formate</sourcing_and_processing_data/supported_formats>`)
fr: Cette méthode consiste à ajouter plusieurs fichiers un par un à la plateforme, de façon à créer autant de sources que le nombre de fichiers ajoutés. Dans cette situation, étant donné qu'une source différente est créée pour chaque fichier ajouté, ceux-ci peuvent être de divers formats (voir :doc:`Formats pris en charge</sourcing_and_processing_data/supported_formats>`).

source: In Catalog > Datasets, click on the **New dataset** button.
de: Klicken Sie unter Katalog > Datensätze auf den Button **Neuer Datensatz**.
fr: Dans Catalogue > Jeu de données, cliquez sur le bouton **Nouveau jeu de données**.

source: Click on the **Add a source** button.
de: Klicken Sie auf den Button **Eine Quelle hinzufügen**.
fr: Cliquez sur le bouton **Ajouter une source**.

source: Choose one of the 3 available methods to upload your first file (see :doc:`Sourcing data<sourcing_data>`).
de: Wählen Sie eine der 3 möglichen Methoden, um Ihre erste Datei hochzuladen (siehe :doc:`Daten einspeisen<sourcing_data>`).
fr: Optez pour l'une des trois méthodes proposées pour télécharger votre premier fichier (voir :doc:`Collecte de données<sourcing_data>`).

source: Once the first file is added, click again on the **Add a source** button.
de: Nachdem die erste Datei hinzugefügt wurde, klicken Sie erneut auf den Button **Eine Quelle hinzufügen**.
fr: Après avoir ajouté le premier fichier, cliquez une nouvelle fois sur le bouton **Ajouter une source**.

source: Repeat the procedure from step 3 as many times as you need, until all your files have been added into the new dataset.
de: Wiederholen Sie den Vorgang ab Schritt 3 so oft wie nötig, bis Sie all Ihre Dateien zum neuen Datensatz hinzugefügt haben.
fr: Répétez la procédure à partir de l'étape 3 autant de fois que nécessaire, c'est-à-dire jusqu'à ce que tous vos fichiers soient ajoutés dans le nouveau jeu de données.

source: Data schema when adding files one by one
de: Datenschema beim Hinzufügen von einzelnen Dateien
fr: Schéma de données lors de l'ajout des fichiers un par un

source: With this method, it's the first file to be added that determines the data schema. In other words, if the other files contain fields that do not match those in the first added file, they will be ignored by the platform.
de: Bei dieser Vorgehensweise wird das Datenschema von der Datei, die als erstes hinzugefügt wurde, bestimmt. Wenn also andere Dateien Felder enthalten, die nicht mit denen der ersten hinzugefügten Datei übereinstimmen, werden sie von der Plattform ignoriert.
fr: Avec cette méthode, c'est le premier fichier ajouté qui détermine le schéma de données. En d'autres termes, si les autres fichiers contiennent des champs qui ne correspondent pas à ceux du premier fichier ajouté, ils seront ignorés par la plateforme.

source: Sourcing multiple files within an archive
de: Mehrere Dateien mithilfe eines Archivs einspeisen
fr: Collecte de plusieurs fichiers dans une archive

source: This method consists in adding several files at the same time via an archive file, creating one same source for all the added files. In that case, because only one source is created for all the files, those have to have the same format (see :doc:`Supported formats</sourcing_and_processing_data/supported_formats>`).
de: Bei dieser Methode werden mehrere Dateien gleichzeitig mithilfe einer Archivdatei hinzugefügt, wobei eine einzige Quelle für alle hinzugefügten Dateien erzeugt wird. In diesem Fall - und weil für alle hinzugefügten Dateien nur eine Quelle erstellt wird - haben sie das gleiche Format ( siehe :doc:`Unterstützte Formate</sourcing_and_processing_data/supported_formats>`).
fr: Cette méthode consiste à ajouter plusieurs fichiers simultanément via un fichier d'archive, de façon à créer une source identique pour tous les fichiers ajoutés. Dans cette situation, étant donné qu'une seule source est créée pour l'ensemble des fichiers, ceux-ci doivent tous avoir le même format (voir :doc:`Formats pris en charge</sourcing_and_processing_data/supported_formats>`).

source: Data schema when adding multiple files at once
de: Datenschema beim gleichzeitigen Hinzufügen von mehreren Dateien
fr: Schéma de données lors de d'ajout de plusieurs fichiers simultanément

source: With this method, the platform will choose the file with the oldest modification time to determine the data schema.
de: Bei dieser Vorgehensweise wählt die Plattform die Datei mit dem ältesten Änderungszeitpunkt, um das Datenschema zu bestimmen.
fr: Avec cette méthode, la plateforme choisira le fichier possédant la date de modification la plus ancienne pour déterminer le schéma de données.

source: Create an archive file (see :ref:`Supported compressed file formats<supportedcompressedformats>`) with the files to add in the same dataset.
de: Erzeugen Sie eine Archivdatei (siehe :ref:`Unterstützte komprimierte Dateiformate<supportedcompressedformats>`) mit Dateien, die zum gleichen Datensatz hinzugefügt werden sollen.
fr: Créez un fichier d'archive (voir :ref:`Formats de fichiers compressés pris en charge<supportedcompressedformats>`) avec les fichiers à ajouter au même jeu de données.

source: Source the archive file using one of the 3 available methods (see :doc:`Sourcing data</sourcing_and_processing_data/sourcing_data>`).
de: Wählen Sie eine der 3 möglichen Methoden, um die Archivdatei hochzuladen (siehe :doc:`Daten einspeisen</sourcing_and_processing_data/sourcing_data>`).
fr: Collectez le fichier d'archive grâce à l'une des trois méthodes proposées (voir :doc:`Collecte de données</sourcing_and_processing_data/sourcing_data>`).

source: Sourcing a shapefile
de: Eine Shapefile hinzufügen
fr: Collecte d'un fichier Shapefile

source: To source a shapefile (containing file formats such as .shp, .dbf and .prj), create an archive file with all the needed files inside and follow the procedure above.
de: Um eine Shapefile hinzuzufügen (mit Dateiformaten wie .shp, .dbf and .prj), erzeugen Sie eine Archivdatei mit allen benötigten Dateien und befolgen Sie die oben beschriebene Vorgehensweise.
fr: Pour collecter un fichier Shapefile (contenant des formats de fichiers comme .shp, .dbf et .prj), créez un fichier d'archive avec tous les fichiers nécessaires dedans et suivez la procédure ci-dessus.

source: Sourcing multiple files stored on an FTP server
de: Mehrere auf einem FTP-Server gespeicherte Dateien hinzufügen
fr: Collecte de plusieurs fichiers stockés sur un serveur FTP

source: This method consists in connecting the platform to the directory of an FTP server (e.g. ftp://example.org/my_dir/) to retrieve all the files contained in this directory.
de: Bei dieser Methode wird die Plattform mit dem Verzeichnis eines FTP-Servers (z. B.: ftp://example.org/my_dir/)) verbunden, um alle Dateien aus diesem Verzeichnis zu erfassen.
fr: Cette méthode consiste à connecter la plateforme au répertoire d'un serveur FTP (par ex. ftp://example.org/my_dir/) pour récupérer tous les fichiers de ce répertoire.

source: Directory and subdirectories
de: Verzeichnis und Unterverzeichnisse
fr: Répertoire et sous-répertoires

source: All the files in the directory need to have the same format and schema (e.g. CSV files with the same column titles). Files must also not be inside subdirectories: if the URL points towards a directory containing a compressed file, the latter will be imported into the platform as such -it will not be unzipped.
de: Alle Dateien im Verzeichnis müssen das gleiche Format und Schema haben (z. B. CSV-Dateien mit denselben Spaltentiteln). Die Dateien dürfen sich außerdem nicht in Unterverzeichnissen befinden: wenn die URL auf ein Verzeichnis mit einer komprimierten Datei verweist, wird diese als solche in die Plattform importiert und nicht automatisch entpackt.
fr: Tous les fichiers du répertoire doivent avoir le même format et le même schéma (par ex. des fichiers CSV avec des titres de colonnes identiques). En outre, les fichiers ne doivent pas se trouver dans des sous-répertoires : si l'URL pointe vers un répertoire contenant un fichier compressé, ce dernier est importé tel quel (non décompressé) dans la plateforme.

source: In the **Enter a URL** box, write the URL of the FTP server where the files are stored.
de: Geben Sie in das Feld **Eine URL eingeben** die URL des FTP-Servers ein, auf dem die Dateien gespeichert sind.
fr: Dans le champ **Saisir une URL**, saisissez l'URL du serveur FTP sur lequel les fichiers sont stockés.

source: Deleted files in FTP server
de: Gelöschte Dateien auf dem FTP-Server
fr: Fichiers supprimés sur le serveur FTP

source: When synchronizing from a remote FTP location, OpenDataSoft keeps a persistent cache and does not automatically prune files missing from the remote directory. Please contact OpenDataSoft's support if you need some cleanup to be performed.
de: Beim Synchronisieren aus einem Remote-FTP-Standort behält OpenDataSoft einen persistenten Cache bei und löscht fehlende Dateien nicht automatisch aus dem Remote-Verzeichnis. Bitte kontaktieren Sie den OpenDataSoft-Support, falls Sie ein Cleanup durchführen möchten.
fr: Lors de la synchronisation depuis un emplacement FTP distant, OpenDataSoft conserve un cache persistant et ne nettoie pas automatiquement les fichiers absents du répertoire distant. Veuillez contacter l'assistance OpenDataSoft pour tout besoin de nettoyage.
