Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/index.po
Languages: nl

source: Using the API
nl: De API gebruiken

source: An *Application Programming Interface*, or API for short, is an interface designed to let programs exchange data. OpenDataSoft's API provide an unified way of accessing any data that were pushed to the platform, regardless of their source or format, while still enforcing security rules defined by the data owner.
nl: Een "Application Programming Interface" of afgekort API, is een interface die ontworpen werd om programma's toe te laten gegevens uit te wisselen. De API van OpenDataSoft biedt een uniforme manier om toegang te krijgen tot gegevens die naar het platform werden gepusht, ongeacht hun bron of formaat, terwijl nog steeds de veiligheidsregels worden gehanteerd die gedefinieerd werden door de eigenaar van de data.

source: The whole OpenDataSoft platform relies exclusively on these very APIs to access the data. They are heavily used by our `widgets library <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ which are only a presentation layer for the data provided by the APIs.
nl: Het volledige OpenDataSoft-platform vertrouwt exclusief op deze API's om toegang te krijgen tot de data. Ze worden veel gebruikt door onze `widgetsbibliotheek <http://opendatasoft.github.io/ods-widgets/docs/#/api>`_ die enkel een presentatielaag zijn voor de data die verschaft worden door de API's.

source: These APIs allow you to search for datasets, search for data, compute analysis, perform geographic aggregation and much more.
nl: Deze API's laten u toe te zoeken naar datasets, te zoeken naar data, analyses te maken, geografische aggregaties uit te voeren en nog veel meer.

source: To access the developer API documentations, click the following links:
nl: Om toegang te krijgen tot de ontwikkelaar van API-documentatie, klik op de volgende links:

source: Key concepts
nl: Belangrijkste concepten

source: All APIs will provide you access to the same data, only in different ways. It is very important to be familiar with the nature of this data before diving the full specification of each API.
nl: Alle API's verschaffen u toegang tot dezelfde data, alleen op verschillende manieren. Het is zeer belangrijk om vertrouwd te zijn met de aard van deze data alvorens in de volledige specificatie van elke API te duiken.

source: Everything within the platform is related through a tree structure. Which means that you can think of OpenDataSoft as such:
nl: Alles binnen het platform is met elkaar verbonden via een boomstructuur. Dit betekent dat u als dusdanig over OpenDataSoft kan denken:

source: The **OpenDataSoft platform** is a network of OpenDataSoft portals.
nl: Het **OpenDataSoft-platform** is een netwerk van OpenDataSoft-portalen.

source: A **portal** provides a **catalog** of all of its **datasets**.
nl: Een **portaal** biedt een **catalogus** aan van al zijn **datasets**.

source: Each **dataset** is defined by a dictionary of **metadata**, a **data schema** (specifying fields names and types) and a collection of **records**.
nl: Elke **dataset** wordt gedefinieerd door een woordenboek van **metadata**, een **dataschema** (waarin namen en soorten van velden worden gespecificeerd) en een verzameling van **records**.

source: Each **record** provides values for each of the dataset's fields.
nl: Elk **record** verschaft waarden voor elk van de velden van de dataset.

source: There are of course many more types of data within the platform, but they are only relevant in very specific contexts.
nl: Er zijn natuurlijk veel meer types data binnen het platform, maar deze zijn enkel relevant in zeer specifieke contexten.

source: The OpenDataSoft platform provides its own API (ODS API v1 and v2) and some standard API's implementations such as ODATA , WFS or CSW.
nl: Het OpenDataSoft-platform heeft zijn eigen API (ODS API v1 en v2) een bepaalde standaard implementaties van API's, zoals ODATA , WFS of CSW.

source: This API is the one used internally by the OpenDataSoft platform and widgets. If you want to develop your own application, this is also the best way to go.
nl: Deze API wordt intern gebruikt door het OpenDataSoft-platform en widgets. Indien u uw eigen applicatie wil ontwikkelen, is dit ook de beste manier om tewerk te gaan.

source: Differences between the Search APIs v1 and v2
nl: Verschillen tussen ODS API v1 en API v2

source: This API is currently under development and will be officially available soon.
nl: Deze API is momenteel in ontwikkeling en zal binnenkort officieel beschikbaar worden gesteld.

source: Here is the main differences and key changes between API v1 and API v2.
nl: Dit zijn de belangrijkste verschillen en wijzigingen tussen API v1 en API v2.

source: APIv2 introduces a better implementation of REST principles. Each API entry-point provides links to easily navigate between linked resources (HATEOAS).
nl: APIv2 introduceert een betere implementatie van REST-principes. Elke API entrypoint verschaft koppelingen om gemakkelijk te navigeren tussen gekoppelde bronnen (HATEOAS).

source: This API proposes a more complete query language with new functions and arithmetic expressions.
nl: Deze API biedt een volledigere zoektaal met nieuwe functies en wiskundige uitdrukkingen.

source: Special filters (geofilter or facet filters) are moved to the query language instead. For instance ``geofilter.distance='42,1,100'`` is replaced by ``q=distance(geo_field,geom'Point(42 1)',100)``
nl: Speciale filters (geofilter of facetfilters) worden in plaats daarvan verplaatst naar de zoektaal. Bijvoorbeeld ``geofilter.distance='42,1,100'`` wordt vervangen door ``q=distance(geo_field,geom'Point(42 1)',100)``

source: Aggregation API (former analyze API) comes with a new ``SQL`` like language and is available on catalog in addition to dataset records.
nl: Aggregatie API (vroeger analyse-API) gaat gepaard met een nieuwe ``SQL`` als taal en is beschikbaar op catalogus naast datasetrecords.

source: Exporters have their own entry-point under ``/api/catalog/exports`` and ``/api/catalog/datasets/<dataset_id>/exports``
nl: Exporteurs hebben hun eigen entrypoint onder ``/api/catalog/exports`` en ``/api/catalog/datasets/<dataset_id>/exports``

source: Navigation search (former facet search) and standard search are completely splitted.
nl: Navigatiezoekopdrachten (vroeger facetzoekopdrachten) en standaard zoekopdrachten zijn volledig opgesplitst.

source: What about ODATA, WFS and CSW?
nl: Wat met ODATA, WFS en CSW?

source: These 3 acronyms refer to other standards that the platform implements. If you are not familiar with these standards, then you should stick with the ODS API since it provides the most comprehensive access to the data.
nl: Deze 3 acroniemen verwijzen naar de andere standaarden die het platform implementeert. Wanneer u niet vertrouwd bent met deze standaarden, dient u bij de ODS API te blijven aangezien deze de meest allesomvattende toegang tot de data biedt.

source: ODATA is a standard for REST APIs that provide a common language to be used across APIs to perform requests. The trade-off for this norm's generic approach is its higher complexity compared to traditional custom REST APIs.
nl: ODATA is een standaard voor REST API's die een gewone taal aanbieden die gebruikt kan worden in API's om aanvragen uit te voeren. De trade-off voor deze generische benadering van deze norm is de hogere complexiteit ervan in vergelijk met traditionele aanpasbare REST API's.

source: OpenDataSoft implements this norm for the simple operations (searching for datasets and records) but the more complex ones (such as analysis, aggregations, geographic computations...) are only available through our V1 and V2 APIs.
nl: OpenDataSoft implementeert deze norm voor de gewone operaties (zoeken naar datasets en records) maar de meer complexe (zoals analyse, aggregaties, geografische berekeningen, ...) zijn enkel beschikbaar via onze V1 en V2 API's.

source: WFS and CSW
nl: WFS en CSW

source: These are both standards focusing on geographic data and as such are especially relevant if you're looking to interface the platform with other GIS software.
nl: Dit zijn beide standaarden die zich focussen op geografische data en als dusdanig vooral relevant zijn wanneer u op zoek bent om het platform te interfacen met andere GIS software.
