Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/extract_bit_range.po
Languages: it

source: Extract bit range processor
it: Processore Estrai intervallo di bit

source: This processor extracts an arbitrary bit range from an hexadecimal content and converts it into one of the following data types: integer, unsigned integer and float.
it: Questo processore estrae un intervallo di bit arbitrario da un contenuto in formato esadecimale e lo converte in uno dei seguenti tipi di dati: intero, intero senza segno e con virgola mobile.

source: Example of use: when processing data coming from a network of sensors as sensors often encode their payloads as hexadecimal content.
it: Esempio di utilizzo: quando si elaborano dati provenienti da una rete di sensori, poiché spesso i sensori codificano il payload come contenuto esadecimale.

source: Setting the processor
it: Configurazione del processore

source: To set the parameters of the Extract bit range processor, follow the indications from the table below.
it: Per configurare i parametri del processore Estrai intervallo di bit, procedi come descritto nella tabella sottostante.

source: Label
it: Etichetta

source: Description
it: Descrizione

source: Mandatory
it: Obbligatorio

source: Example
it: Esempio

source: Field
it: Campo

source: Field containing the hexadecimal content
it: Campo con contenuto esadecimale

source: yes
it: sì

source: Start bit offset
it: Inizia offset bit

source: Starting offset corresponding to the position of the first bit. It starts at 0.
it: L'offset iniziale corrisponde alla posizione del primo bit. Inizia da 0.

source: Stop bit offset
it: Interrompi offset bit

source: Ending offset corresponding to the position of the last bit. Must be greater than the starting offset.
it: L'offset finale corrisponde alla posizione dell'ultimo bit. Deve essere maggiore dell'offset iniziale.

source: Convert to
it: Converti in

source: Wanted format to output and convert the data
it: Formato in cui si desidera ottenere l'output e convertire i dati

source: Either int (integer), uint (unsigned integer) or float
it: int (intero), uint (intero senza segno) o float

source: Output field
it: Campo di output

source: Field where the extracted bit range will be displayed. It can be an existing field chosen from the list, or a new field created for that purpose (in that case, choose **Input text** from the list and write the name of the new field in the text area below).
it: Campo in cui verrà visualizzato l'intervallo di bit estratto. Può essere un campo esistente all'interno dell'elenco o un nuovo campo creato appositamente allo scopo. In tal caso, seleziona **Inserisci testo** nell'elenco e digita il nome del nuovo campo nell'area di testo sottostante.

source: A temperature sensor sends an hexadecimal value.
it: Un sensore di temperatura invia un valore in formato esadecimale.

source: This hexadecimal value (2 bytes) contains: - a decimal value encoded on the 1st byte - the sensor identifier encoded on the first 4 bits of the 2nd byte - a set of flags representing the sensor configuration, encoded on the remaining 4 bits
it: Questo valore in formato esadecimale (2 byte) contiene: - un valore decimale codificato sul primo byte - l'identificatore del sensore codificato sui primi 4 bit del secondo byte - una serie di flag che rappresentano la configurazione del sensore, codificati nei restanti 4 bit

source: the first byte '00010110' is the temperature in degrees
it: il primo byte '00010110' è la temperatura espressa in gradi

source: the next 4 bits '0100' is the sensor identifier
it: i successivi 4 bit '0100' sono l'identificatore del sensore

source: the next 4 bits '1001' is the sensor configuration, but we only want the first bit
it: gli altri 4 bit '1001' sono la configurazione del sensore, ma a noi serve solo il primo bit

source: Therefore, the processing pipeline will contains 3 Extract bit range processors
it: La pipeline di elaborazione conterrà pertanto 3 processori Estrai intervallo di bit

source: one Extract bit range from 0 to 7 to convert into signed integer (int) -> int_temperature
it: un Estrai intervallo di bit da 0 a 7 per la conversione in intero con segno (int) -> int_temperature

source: one Extract bit range from 8 to 11 to convert into unsigned integer (uint) -> sensor_identifier
it: un Estrai intervallo di bit da 8 a 11 per la conversione in intero senza segno (uint) -> sensor_identifier

source: one Extract bit range from 12 to 13 to convert into unsigned integer, 0 meaning "Not OK" and 1 meaning "OK" (uint) -> status
it: un Estrai intervallo di bit da 12 a 13 per la conversione in intero senza segno, in cui 0 significa "Non OK" e 1 significa "OK" (uint) -> status

source: Extract bit range 1
it: Estrai intervallo di bit 1

source: Extract bit range 2
it: Estrai intervallo di bit 2

source: Extract bit range 3
it: Estrai intervallo di bit 3

source: Final result:
it: Risultato finale:
