Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/05_processing_data/processors/set_timezone.po
Languages: it

source: Set Timezone processor
it: Processore Imposta fuso orario

source: This processor allows to force the timezone of a datetime field.
it: Questo processore consente di imporre il fuso orario di un campo data/ora.

source: By default, datetime records are in UTC timezone.
it: Per impostazione predefinita, i record di data/ora sono espressi nel fuso orario UTC.

source: Example: if a dataset contains a datetime field with an absent ("2016-12-08T08:51:53") or incorrect ("2016-12-08T08:51:53Z") timezone, the processor can force the timezone ("2016-12-08T08:51:53+00:00" if timezone set to UTC for example).
it: Esempio: se un dataset contiene un campo data/ora con fuso orario assente ("2016-12-08T08:51:53") o errato ("2016-12-08T08:51:53Z"), il processore permette di forzarlo ("2016-12-08T08:51:53+00:00" se il fuso orario è impostato, ad esempio, su UTC).

source: Setting the processor
it: Configurazione del processore

source: To set the parameters of the Set Timezone processor, follow the indications from the table below.
it: Per configurare i parametri del processore Imposta fuso orario, procedi come descritto nella tabella sottostante.

source: Label
it: Etichetta

source: Description
it: Descrizione

source: Mandatory
it: Obbligatorio

source: Field
it: Campo

source: Datetime field containing the date
it: Campo data/ora contenente la data

source: yes
it: sì

source: Timezone
it: Fuso orario

source: Timezone to apply to the datetime field
it: Fuso orario da applicare al campo data/ora
