Repository: emeldah/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publishing_data/07_configuring_visualizations/02_configuring_map_view/map.po
Languages: it

source: Configuring the map view
it: Configurazione della visualizzazione su mappa

source: The map view is only available to datasets containing at least one geo field (geo point or geo shape).
it: La visualizzazione su mappa è disponibile solo per i dataset contenenti almeno un campo geografico (geopoint o geoshape).

source: You can configure the appearance of the map itself:
it: È possibile configurare l'aspetto della mappa:

source: If a tooltip displays more than one item (when multiple records have the same location for example), you can set their relative order
it: Se un tooltip presenta più di una voce, ad esempio nel caso di più record con la stessa ubicazione, puoi definirne l'ordine.

source: If you have more than one basemap on your domain, you can set which one is selected by default for this dataset (otherwise it is the first one in the list)
it: Se disponi di più di una mappa di base per il tuo dominio, puoi impostare quella predefinita per il dataset in questione (in caso contrario verrà scelta la prima dell'elenco).

source: The color of the shapes and points displayed on the map
it: Puoi impostare il colore delle forme e dei punti visualizzati sulla mappa.

source: If the data is represented as points, you can configure how it is displayed: a simple icon, little dots, or a familiar marker
it: Se i dati sono rappresentati come punti, puoi configurarne la visualizzazione nei seguenti formati: semplice icona, piccoli punti o marcatore familiare.

source: The map view options
it: Opzioni della visualizzazione su mappe

source: Setting up the tooltip
it: Configurazione dei tooltip

source: On a map, a click on a point will bring forward a tooltip containing more information
it: Cliccando su un punto presente in una mappa puoi aprire un tooltip contenente maggiori informazioni.
